Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSmu_bf.h
/** \brief Offset for Ifx_SMU_AFCNT_Bits.FCO */
#define IFX_SMU_AFCNT_FCO_OFF (30u)

/** \brief Length for Ifx_SMU_AFCNT_Bits.ACO */
#define IFX_SMU_AFCNT_ACO_LEN (1u)

/** \brief Mask for Ifx_SMU_AFCNT_Bits.ACO */
#define IFX_SMU_AFCNT_ACO_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AFCNT_Bits.ACO */
#define IFX_SMU_AFCNT_ACO_OFF (31u)

/** \brief Length for Ifx_SMU_RTAC_RTAC0_Bits.GID0 */
#define IFX_SMU_RTAC_RTAC0_GID0_LEN (4u)

/** \brief Mask for Ifx_SMU_RTAC_RTAC0_Bits.GID0 */
#define IFX_SMU_RTAC_RTAC0_GID0_MSK (0xfu)

/** \brief Offset for Ifx_SMU_RTAC_RTAC0_Bits.GID0 */
#define IFX_SMU_RTAC_RTAC0_GID0_OFF (0u)

/** \brief Length for Ifx_SMU_RTAC_RTAC0_Bits.ALID0 */
#define IFX_SMU_RTAC_RTAC0_ALID0_LEN (5u)

/** \brief Mask for Ifx_SMU_RTAC_RTAC0_Bits.ALID0 */
#define IFX_SMU_RTAC_RTAC0_ALID0_MSK (0x1fu)

/** \brief Offset for Ifx_SMU_RTAC_RTAC0_Bits.ALID0 */
#define IFX_SMU_RTAC_RTAC0_ALID0_OFF (4u)

/** \brief Length for Ifx_SMU_RTAC_RTAC0_Bits.GID1 */
#define IFX_SMU_RTAC_RTAC0_GID1_LEN (4u)

/** \brief Mask for Ifx_SMU_RTAC_RTAC0_Bits.GID1 */
#define IFX_SMU_RTAC_RTAC0_GID1_MSK (0xfu)

/** \brief Offset for Ifx_SMU_RTAC_RTAC0_Bits.GID1 */
#define IFX_SMU_RTAC_RTAC0_GID1_OFF (16u)

/** \brief Length for Ifx_SMU_RTAC_RTAC0_Bits.ALID1 */
#define IFX_SMU_RTAC_RTAC0_ALID1_LEN (5u)

/** \brief Mask for Ifx_SMU_RTAC_RTAC0_Bits.ALID1 */
#define IFX_SMU_RTAC_RTAC0_ALID1_MSK (0x1fu)

/** \brief Offset for Ifx_SMU_RTAC_RTAC0_Bits.ALID1 */
#define IFX_SMU_RTAC_RTAC0_ALID1_OFF (20u)

/** \brief Length for Ifx_SMU_RTAC_RTAC1_Bits.GID2 */
#define IFX_SMU_RTAC_RTAC1_GID2_LEN (4u)

/** \brief Mask for Ifx_SMU_RTAC_RTAC1_Bits.GID2 */
#define IFX_SMU_RTAC_RTAC1_GID2_MSK (0xfu)

/** \brief Offset for Ifx_SMU_RTAC_RTAC1_Bits.GID2 */
#define IFX_SMU_RTAC_RTAC1_GID2_OFF (0u)

/** \brief Length for Ifx_SMU_RTAC_RTAC1_Bits.ALID2 */
#define IFX_SMU_RTAC_RTAC1_ALID2_LEN (5u)

/** \brief Mask for Ifx_SMU_RTAC_RTAC1_Bits.ALID2 */
#define IFX_SMU_RTAC_RTAC1_ALID2_MSK (0x1fu)

/** \brief Offset for Ifx_SMU_RTAC_RTAC1_Bits.ALID2 */
#define IFX_SMU_RTAC_RTAC1_ALID2_OFF (4u)

/** \brief Length for Ifx_SMU_RTAC_RTAC1_Bits.GID3 */
#define IFX_SMU_RTAC_RTAC1_GID3_LEN (4u)

/** \brief Mask for Ifx_SMU_RTAC_RTAC1_Bits.GID3 */
#define IFX_SMU_RTAC_RTAC1_GID3_MSK (0xfu)

/** \brief Offset for Ifx_SMU_RTAC_RTAC1_Bits.GID3 */
#define IFX_SMU_RTAC_RTAC1_GID3_OFF (16u)

/** \brief Length for Ifx_SMU_RTAC_RTAC1_Bits.ALID3 */
#define IFX_SMU_RTAC_RTAC1_ALID3_LEN (5u)

/** \brief Mask for Ifx_SMU_RTAC_RTAC1_Bits.ALID3 */
#define IFX_SMU_RTAC_RTAC1_ALID3_MSK (0x1fu)

/** \brief Offset for Ifx_SMU_RTAC_RTAC1_Bits.ALID3 */
#define IFX_SMU_RTAC_RTAC1_ALID3_OFF (20u)

/** \brief Length for Ifx_SMU_AEX_Bits.IRQ0STS */
#define IFX_SMU_AEX_IRQ0STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.IRQ0STS */
#define IFX_SMU_AEX_IRQ0STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.IRQ0STS */
#define IFX_SMU_AEX_IRQ0STS_OFF (0u)

/** \brief Length for Ifx_SMU_AEX_Bits.IRQ1STS */
#define IFX_SMU_AEX_IRQ1STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.IRQ1STS */
#define IFX_SMU_AEX_IRQ1STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.IRQ1STS */
#define IFX_SMU_AEX_IRQ1STS_OFF (1u)

/** \brief Length for Ifx_SMU_AEX_Bits.IRQ2STS */
#define IFX_SMU_AEX_IRQ2STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.IRQ2STS */
#define IFX_SMU_AEX_IRQ2STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.IRQ2STS */
#define IFX_SMU_AEX_IRQ2STS_OFF (2u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST0STS */
#define IFX_SMU_AEX_RST0STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST0STS */
#define IFX_SMU_AEX_RST0STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST0STS */
#define IFX_SMU_AEX_RST0STS_OFF (3u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST1STS */
#define IFX_SMU_AEX_RST1STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST1STS */
#define IFX_SMU_AEX_RST1STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST1STS */
#define IFX_SMU_AEX_RST1STS_OFF (4u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST2STS */
#define IFX_SMU_AEX_RST2STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST2STS */
#define IFX_SMU_AEX_RST2STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST2STS */
#define IFX_SMU_AEX_RST2STS_OFF (5u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST3STS */
#define IFX_SMU_AEX_RST3STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST3STS */
#define IFX_SMU_AEX_RST3STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST3STS */
#define IFX_SMU_AEX_RST3STS_OFF (6u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST4STS */
#define IFX_SMU_AEX_RST4STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST4STS */
#define IFX_SMU_AEX_RST4STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST4STS */
#define IFX_SMU_AEX_RST4STS_OFF (7u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST5STS */
#define IFX_SMU_AEX_RST5STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST5STS */
#define IFX_SMU_AEX_RST5STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST5STS */
#define IFX_SMU_AEX_RST5STS_OFF (8u)

/** \brief Length for Ifx_SMU_AEX_Bits.NMISTS */
#define IFX_SMU_AEX_NMISTS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.NMISTS */
#define IFX_SMU_AEX_NMISTS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.NMISTS */
#define IFX_SMU_AEX_NMISTS_OFF (9u)

/** \brief Length for Ifx_SMU_AEX_Bits.RSTSTS */
#define IFX_SMU_AEX_RSTSTS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RSTSTS */
#define IFX_SMU_AEX_RSTSTS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RSTSTS */
#define IFX_SMU_AEX_RSTSTS_OFF (10u)

/** \brief Length for Ifx_SMU_AEX_Bits.EMSSTS */
#define IFX_SMU_AEX_EMSSTS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.EMSSTS */
#define IFX_SMU_AEX_EMSSTS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.EMSSTS */
#define IFX_SMU_AEX_EMSSTS_OFF (11u)

/** \brief Length for Ifx_SMU_AEX_Bits.IRQ0AEM */
#define IFX_SMU_AEX_IRQ0AEM_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.IRQ0AEM */
#define IFX_SMU_AEX_IRQ0AEM_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.IRQ0AEM */
#define IFX_SMU_AEX_IRQ0AEM_OFF (16u)

